#{{{
# 要引入的包
#{{{
use Date::Manip;
use Encode;
#}}}
# 定义日期 
#{{{
my $base_workweek=35;
my $base_workyear="2013W";
#}}}
my @classes_teachers;
#{{{
@classes_teachers = (
		     {
		      "一（5）" => "谢芳",
		      "一（6）" => "洪钧",
		      "一（7）" => "谢芳",
		      "一（8）" => "谢芳",
		      "一（9）" => "洪钧",
		     },
		     {
		      "二（5）" => "辛韶琴",
		      "二（6）" => "辛韶琴",
		      "二（7）" => "辛韶琴",
		      "二（8）" => "辛韶琴",
		      "二（9）" => "辛韶琴",
		     },
		     {
		      "三（5）" => "谢芳",
		      "三（6）" => "谢芳",
		      "三（7）" => "谢芳",
		      "三（8）" => "谢芳",
		     },
		     {
		      "四（5）" => "辛韶琴",
		      "四（6）" => "辛韶琴",
		      "四（7）" => "辛韶琴",
		      "四（8）" => "辛韶琴",
		     },
		     {
		      "五（5）" => "洪钧",
		      "五（6）" => "洪钧",
		      "五（7）" => "洪钧",
		      "五（8）" => "洪钧",
		     },
		    );
#}}}

my @classes_lessons;
#{{{
@classes_lessons = (
		    [
		     {
		      "一（5）" => 3,
		      "一（6）" => 2,
		      "一（7）" => 1,
		      "一（8）" => 1,
		      "一（9）" => 4,
		     },
		     {
		      "二（5）" => 4,
		      "二（6）" => 1,
		      "二（7）" => 1,
		      "二（8）" => 1,
		      "二（9）" => 4,
		     },
		     {
		      "三（5）" => 2,
		      "三（6）" => 1,
		      "三（7）" => 2,
		      "三（8）" => 3,
		     },
		     {
		      "四（5）" => 2,
		      "四（6）" => 1,
		      "四（7）" => 2,
		      "四（8）" => 3,
		     },
		     {
		      "五（5）" => 3,
		      "五（6）" => 1,
		      "五（7）" => 1,
		      "五（8）" => 2,
		     },
		    ],
		    [
		     {
		      "一（5）" => 5,
		      "一（6）" => 2,
		      "一（7）" => 5,
		      "一（8）" => 3,
		      "一（9）" => 5,
		     },
		     {
		      "二（5）" => 5,
		      "二（6）" => 5,
		      "二（7）" => 3,
		      "二（8）" => 2,
		      "二（9）" => 5,
		     },
		     {
		      "三（5）" => 4,
		      "三（6）" => 3,
		      "三（7）" => 5,
		      "三（8）" => 4,
		     },
		     {
		      "四（5）" => 4,
		      "四（6）" => 3,
		      "四（7）" => 4,
		      "四（8）" => 4,
		     },
		     {
		      "五（5）" => 4,
		      "五（6）" => 4,
		      "五（7）" => 3,
		      "五（8）" => 3,
		     },
		    ],
		   );
#}}}

my @weeks_grades_subjects;
#{{{
# gawk "{print \"[\"$1\"],\",\"[\"$2\"],\",\"[\"$3\"]\"}" testlesson1.txt > t2.txt
# replace [ ] with " " in t2.txt
# gawk "{print \"[\"$0\"],\"}" t2.txt > t3.txt
@weeks_grades_subjects = (
			  ["第一周", "一", "第一课"],
			  ["第一周", "二", "第二课"],
			  ["第二周", "三", "第三课"],
			  ["第三周", "四", "第四课"],
			  ["第四周", "五", "第五课"],
);
#}}}
#}}}

print $classes_lessons[0][0]{"一（5）"}. "\n";
