use Date::Manip;
use Encode;

my $base_workweek=35;
my $base_workyear="2013W";

my %grade_teacher = (
		     "一5" => "谢芳",
		     "一6" => "洪钧",
		     "一7" => "谢芳",
		     "一8" => "谢芳",
		     "一9" => "洪钧",
		     "二5" => "辛韶琴",
		     "二6" => "辛韶琴",
		     "二7" => "辛韶琴",
		     "二8" => "辛韶琴",
		     "三5" => "谢芳",
		     "三6" => "谢芳",
		     "三7" => "谢芳",
		     "三8" => "谢芳",
		     "四5" => "辛韶琴",
		     "四6" => "辛韶琴",
		     "四7" => "辛韶琴",
		     "四8" => "辛韶琴",
		     "五5" => "洪钧",
		     "五6" => "洪钧",
		     "五7" => "洪钧",
		     "五8" => "洪钧",
);

# 按照每一个班级在每周的第几天上课来定数组中每个元素的值，比如周一上课，就是 1， 而元素的顺序代表是几班。
# 比如一5班，就是 $lesson_list[0][0] ，其值为5， 代表在周五上课。
my @lesson_list;  
                  
$lesson_list[0][0]=[(5,2,5,3,5)];
$lesson_list[0][1]=[(4,1,3,2,4)];
$lesson_list[0][2]=[(4,1,5,4)];
$lesson_list[0][3]=[(2,1,2,4)];
$lesson_list[0][4]=[(3,1,1,3)];

# 考虑一周的课有两节的话，就有第一节和第二节之分
# 因为一个学期的课不可能上到二十几周
# 所以用 20 几来代表第二节的课
my %week_number=(
	      "第一周上" => 1,
	      "第一周下" => 21,
	      "第二周上" => 2,
	      "第二周下" => 22,
	      "第三周上" => 3,
	      "第三周下" => 23,
	      "第四周上" => 4,
	      "第四周下" => 24,
	      "第五周上" => 5,
	      "第五周下" => 25,
	      "第六周上" => 6,
	      "第六周下" => 26,
	      "第七周上" => 7,
	      "第七周下" => 27,
	      "第八周上" => 8,
	      "第八周下" => 28,
	      "第九周上" => 9,
	      "第九周下" => 29,
	      "第十周上" => 10,
	      "第十周下" => 30,
	      "第十一周上" => 11,
	      "第十一周下" => 31,
	      "第十二周上" => 12,
	      "第十二周下" => 32,
	      "第十三周上" => 13,
	      "第十三周下" => 33,
	      "第十四周上" => 14,
	      "第十四周下" => 34,
	      "第十五周上" => 15,
	      "第十五周下" => 35,
	      "第十六周上" => 16,
	      "第十六周下" => 36,
	      "第十七周上" => 17,
	      "第十七周下" => 37,
);

# 接下来就是每读取一行，先看是几年级的，然后按 @lesson_list 
