#{{{
# 要引入的包
#{{{
use Date::Manip;
use Encode;
#}}}
# 定义日期 
#{{{
my $base_workweek=35;
my $base_year = "2016";
my $base_workyear=$base_year . "W";
my @short_holidays = qw (0101 0405 0406 0407 0501 0502 0503 0602 0831 0901 0903 0904 0905 0908 1001 1002 1003 1004 1005 1006 1007 );
#}}}
my @classes_teachers;
#{{{
@classes_teachers = (
		     {
		      "一（5）" => "谢芳",
		      "一（6）" => "谢芳",
		      "一（7）" => "张靥青",
		      "一（8）" => "谢芳",
		     },
		     {
		      "二（5）" => "辛韶琴",
		      "二（6）" => "辛韶琴",
		      "二（7）" => "辛韶琴",
		      "二（8）" => "冯爱军",
		     },
		     {
		      "三（5）" => "谢芳",
		      "三（6）" => "谢芳",
		      "三（7）" => "谢芳",
		      "三（8）" => "谢芳",
		     },
		     {
		      "四（5）" => "洪钧",
		      "四（6）" => "洪钧",
		      "四（7）" => "洪钧",
		      "四（8）" => "洪钧",
		      "四（9）" => "洪钧",
		     },
		     {
		      "五（5）" => "辛韶琴",
		      "五（6）" => "辛韶琴",
		      "五（7）" => "辛韶琴",
		      "五（8）" => "辛韶琴",
		      "五（9）" => "洪钧",
		     },
		    );
#}}}

my @classes_lessons;
#{{{
@classes_lessons = (
		    [
		     {
		      "一（5）" => 4,
		      "一（6）" => 2,
		      "一（7）" => 1,
		      "一（8）" => 1,
		     },
		     {
		      "二（5）" => 1,
		      "二（6）" => 2,
		      "二（7）" => 1,
		      "二（8）" => 1,
		     },
		     {
		      "三（5）" => 2,
		      "三（6）" => 2,
		      "三（7）" => 1,
		      "三（8）" => 1,
		     },
		     {
		      "四（5）" => 1,
		      "四（6）" => 1,
		      "四（7）" => 3,
		      "四（8）" => 4,
		      "四（9）" => 2,
		     },
		     {
		      "五（5）" => 1,
		      "五（6）" => 3,
		      "五（7）" => 2,
		      "五（8）" => 2,
		      "五（9）" => 2,
		     },
		    ],
		    [
		     {
		      "一（5）" => 5,
		      "一（6）" => 4,
		      "一（7）" => 5,
		      "一（8）" => 3,
		     },
		     {
		      "二（5）" => 4,
		      "二（6）" => 4,
		      "二（7）" => 5,
		      "二（8）" => 4,
		     },
		     {
		      "三（5）" => 3,
		      "三（6）" => 3,
		      "三（7）" => 3,
		      "三（8）" => 4,
		     },
		     {
		      "四（5）" => 3,
		      "四（6）" => 4,
		      "四（7）" => 4,
		      "四（8）" => 5,
		      "四（9）" => 5,
		     },
		     {
		      "五（5）" => 3,
		      "五（6）" => 4,
		      "五（7）" => 3,
		      "五（8）" => 4,
		      "五（9）" => 3,
		     },
		    ],
		   );
#}}}

my @weeks_grades_subjects;
#{{{
# gawk "{print \"[\"$1\"],\",\"[\"上\"],\",\"[\"$2\"],\",\"[\"$3\"]\"}" testlesson1.txt > t2.txt
# replace [ ] with " " in t2.txt
# gawk "{print \"[\"$0\"],\"}" t2.txt > t3.txt
# 根据国庆时间调整，本年度错开第五周下和第六周上
# 2016年只有第六周碰到国庆假期
@weeks_grades_subjects = (
			  ["第一周", "上", "五", "神奇的变化"],
			  ["第一周", "下", "五", "魔幻的液体"],
			  ["第二周", "上", "五", "变化和复原"],
			  ["第二周", "下", "四", "水的旅行"],
			  ["第三周", "上", "三", "叶的光合作用"],
			  ["第三周", "上", "四", "水循环与天气现象"],
			  ["第三周", "下", "四", "水的污染与净化"],
			  ["第三周", "下", "三", "叶的蒸腾作用"],
			  ["第四周", "上", "三", "花的结构"],
			  ["第四周", "下", "三", "种子的结构和功能"],
			  ["第七周", "上", "三", "昆虫"],
			  ["第七周", "上", "四", "一天中太阳高低位置的变化"],
			  ["第七周", "下", "三", "鸟"],
			  ["第七周", "下", "四", "地球的内部"],
			  ["第八周", "下", "四", "火山"],
			  ["第八周", "下", "五", "空气的成分"],
			  ["第九周", "上", "四", "陶瓷与玻璃"],
			  ["第九周", "下", "五", "保护大气"],
			  ["第十周", "上", "三", "奇妙的壳"],
			  ["第十周", "上", "五", "岩石、沙和黏土的形成"],
			  ["第十周", "上", "四", "塑料"],
			  ["第十周", "下", "三", "灵巧的鱼"],
			  ["第十周", "下", "五", "土壤的成分"],
			  ["第十一周", "上", "四", "光是怎样传播的"],
			  ["第十一周", "上", "五", "保护土壤"],
			  ["第十一周", "下", "四", "潜望镜的秘密"],
			  ["第十二周", "上", "四", "各种各样的镜子"],
			  ["第十二周", "下", "三", "运动的变化"],
			  ["第十二周", "下", "四", "光的传播路线改道了"],
			  ["第十三周", "上", "三", "热传导"],
			  ["第十三周", "上", "四", "彩虹的由来"],
			  ["第十三周", "下", "三", "热对流与热辐射"],
			  ["第十三周", "下", "四", "声音的产生"],
			  ["第十四周", "上", "三", "液柱为什么会升高"],
			  ["第十四周", "上", "四", "声音的传播"],
			  ["第十四周", "下", "三", "铁轨会变长吗"],
			  ["第十五周", "上", "三", "冰与水"],
			  ["第十五周", "上", "四", "声音的放大与减小"],
			  ["第十五周", "下", "三", "水到哪里去了"],
			  ["第十六周", "上", "三", "抓住水蒸气"],
);
#}}}
my %week_number;
#{{{
%week_number = (
		   "第一周" => 0,
		   "第二周" => 1,
		   "第三周" => 2,
		   "第四周" => 3,
		   "第五周" => 4,
		   "第六周" => 5,
		   "第七周" => 6,
		   "第八周" => 7,
		   "第九周" => 8,
		   "第十周" => 9,
		   "第十一周" => 10,
		   "第十二周" => 11,
		   "第十三周" => 12,
		   "第十四周" => 13,
		   "第十五周" => 14,
		   "第十六周" => 15,
		   "第十七周" => 16,
		   "第十八周" => 17,
);
#}}}
my %half_week;
#{{{
%half_week = (
	      "上" => 0,
	      "下" => 1,
);
#}}}
my %grade_number;
#{{{
%grade_number = (
		 "一" => 0,
		 "二" => 1,
		 "三" => 2,
		 "四" => 3,
		 "五" => 4,
);
#}}}
my @holidays;
#{{{
@holidays = @short_holidays;
foreach my $hdays (@holidays) {
  $hdays = $base_year . $hdays;
};
#}}}
#}}}

my $cur_week;
my $cur_day;
my $cur_time;
my $t_date;
my $cur_teacher;
my $cur_class;
my $cur_subject;
my $in_hdays;
foreach my $emt_line (@weeks_grades_subjects) {
  $cur_week = $base_workweek + $week_number{@$emt_line[0]};
  while (($key,$value) = each %{$classes_lessons[$half_week{@$emt_line[1]}][$grade_number{@$emt_line[2]}]} ) {
    $in_hdays = 0;
    $cur_day = $value;
    $cur_time = $base_workyear . $cur_week . $cur_day; 
    $t_date = ParseDateString($cur_time);
    $t_date = UnixDate($t_date,"%Y%m%d");
    # 跳过假期
    foreach my $hdays (@holidays) {
      if ($hdays == $t_date) {
  	$in_hdays = 1;
  	last;
      }
    };
    if ($in_hdays == 1) {
      next;
    } else {
      print "$t_date $key ";
      print "$classes_teachers[$grade_number{@$emt_line[2]}]{$key} @$emt_line[3]\n";
    }
  }

}; 
